Revit 2024 API
ReferencePointArray.Append Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Append(
	ReferencePoint item
)
Visual Basic
Public Overridable Sub Append ( _
	item As ReferencePoint _
)
Visual C++
public:
virtual void Append(
	ReferencePoint^ item
)
Parameters
item
Type: Autodesk.Revit.DB.ReferencePoint
See Also
ReferencePointArray Class
Autodesk.Revit.DB Namespace